{
  "ir_version": "1.0",
  "project": "structured-roadmap",
  "repository": "https://github.com/grokify/structured-roadmap",
  "versioning": "semver",
  "commit_convention": "conventional",
  "maintainers": ["grokify"],
  "releases": [
    {
      "version": "v0.2.1",
      "date": "2026-01-11",
      "highlights": [
        { "description": "Simplified title format and summary table shown by default" }
      ],
      "added": [
        { "description": "Summary table (overview of all items) now shown by default", "commit": "ad70518" }
      ],
      "fixed": [
        { "description": "Title duplication when project name contains 'Roadmap' (e.g., 'Structured Roadmap Roadmap')", "commit": "ef2c6f0" }
      ],
      "changed": [
        { "description": "Generated title format: now `# Roadmap` with `**Project:** <name>` below instead of `# <name> Roadmap`", "commit": "ef2c6f0" },
        { "description": "Overview table renamed to 'Summary' to avoid conflict with project Overview section", "commit": "ad70518" }
      ]
    },
    {
      "version": "v0.2.0",
      "date": "2026-01-11",
      "highlights": [
        { "description": "Homebrew and multi-platform binary distribution via GoReleaser" },
        { "description": "Overview table sorted by completion then priority, with concise priority labels" }
      ],
      "added": [
        { "description": "Overview table sorting: completion percentage (descending) then priority", "commit": "9008763" },
        { "description": "GoReleaser configuration for multi-platform binary releases (Linux, macOS, Windows × amd64, arm64)", "commit": "bbbd023" },
        { "description": "GitHub Actions release workflow triggered by version tags", "commit": "bbbd023" },
        { "description": "Homebrew tap distribution via `brew install structured-roadmap`", "commit": "bbbd023" },
        { "description": "Binary symlink: both `sroadmap` and `structured-roadmap` commands available", "commit": "bbbd023" },
        { "description": "`version` command showing build info (version, commit, date)", "commit": "6441277" }
      ],
      "changed": [
        { "description": "Priority labels in table cells use concise single-letter format (P0, P1, P2, P3)", "commit": "15ab629" }
      ]
    },
    {
      "version": "v0.1.0",
      "date": "2026-01-10",
      "highlights": [
        { "description": "Machine-readable JSON roadmaps with deterministic Markdown generation, modeled after structured-changelog" }
      ],
      "added": [
        { "description": "JSON IR schema (v1.0) for machine-readable roadmaps", "commit": "38dc07d" },
        { "description": "`roadmap` package with IR types, parsing, and validation", "commit": "38dc07d" },
        { "description": "`renderer` package with deterministic Markdown generation", "commit": "787b8b6" },
        { "description": "`sroadmap` CLI with `validate`, `generate`, `stats`, and `deps` subcommands", "commit": "e36765c" },
        { "description": "Two-dimensional categorization: `area` (project component) + `type` (change type)", "commit": "38dc07d" },
        { "description": "Type validation via structured-changelog integration", "commit": "38dc07d" },
        { "description": "Multiple grouping strategies: area, type, phase, status, quarter, priority", "commit": "787b8b6" },
        { "description": "Phased roadmaps with area sub-sections for large projects", "commit": "787b8b6" },
        { "description": "Rich content block support: text, code, diagram, table, list, blockquote", "commit": "787b8b6" },
        { "description": "Table of contents with progress counts", "commit": "787b8b6" },
        { "description": "Overview table summarizing all items", "commit": "787b8b6" },
        { "description": "Version history tracking", "commit": "787b8b6" },
        { "description": "Dependency tracking between items with Mermaid/DOT graph generation", "commit": "e36765c" },
        { "description": "Customizable status legend", "commit": "38dc07d" },
        { "description": "JSON Schema for IR validation", "commit": "38dc07d" },
        { "description": "Example roadmaps: minimal, full", "commit": "0f1673a" }
      ],
      "documentation": [
        { "description": "README with usage guide and examples", "commit": "e389396" },
        { "description": "PRD documenting schema design decisions", "commit": "e389396" }
      ],
      "tests": [
        { "description": "Unit tests for core functionality", "commit": "38dc07d" }
      ]
    }
  ]
}
