{
  "ir_version": "1.0",
  "project": "structured-roadmap",
  "repository": "https://github.com/grokify/structured-roadmap",
  "versioning": "semver",
  "commit_convention": "conventional",
  "maintainers": ["grokify"],
  "releases": [
    {
      "version": "v0.1.0",
      "date": "2026-01-10",
      "highlights": [
        { "description": "Machine-readable JSON roadmaps with deterministic Markdown generation, modeled after structured-changelog" }
      ],
      "added": [
        { "description": "JSON IR schema (v1.0) for machine-readable roadmaps" },
        { "description": "`roadmap` package with IR types, parsing, and validation" },
        { "description": "`renderer` package with deterministic Markdown generation" },
        { "description": "`sroadmap` CLI with `validate`, `generate`, `stats`, and `deps` subcommands" },
        { "description": "Two-dimensional categorization: `area` (project component) + `type` (change type)" },
        { "description": "Type validation via structured-changelog integration" },
        { "description": "Multiple grouping strategies: area, type, phase, status, quarter, priority" },
        { "description": "Phased roadmaps with area sub-sections for large projects" },
        { "description": "Rich content block support: text, code, diagram, table, list, blockquote" },
        { "description": "Table of contents with progress counts" },
        { "description": "Overview table summarizing all items" },
        { "description": "Version history tracking" },
        { "description": "Dependency tracking between items with Mermaid/DOT graph generation" },
        { "description": "Customizable status legend" },
        { "description": "JSON Schema for IR validation" },
        { "description": "Example roadmaps: minimal, full" }
      ],
      "documentation": [
        { "description": "README with usage guide and examples" },
        { "description": "PRD documenting schema design decisions" }
      ],
      "tests": [
        { "description": "Unit tests for core functionality" }
      ]
    }
  ]
}
