{
  "irVersion": "1.0",
  "project": "Structured Tasks",

  "legend": {
    "completed": {"emoji": "✅", "description": "Completed"},
    "in_progress": {"emoji": "🚧", "description": "In Progress"},
    "planned": {"emoji": "📋", "description": "Planned"},
    "future": {"emoji": "💡", "description": "Under Consideration"}
  },

  "areas": [
    {"id": "core", "name": "Core"},
    {"id": "cli", "name": "CLI"},
    {"id": "renderer", "name": "Renderer"},
    {"id": "integrations", "name": "Integrations"},
    {"id": "distribution", "name": "Distribution"}
  ],

  "tasks": [
    {
      "id": "json-ir",
      "title": "JSON IR schema (v1.0)",
      "description": "Machine-readable task list format with rich metadata",
      "status": "completed",
      "phase": 1,
      "area": "core",
      "type": "Added"
    },
    {
      "id": "tasks-pkg",
      "title": "Tasks package",
      "description": "IR types, parsing, and validation",
      "status": "completed",
      "phase": 1,
      "area": "core",
      "type": "Added"
    },
    {
      "id": "renderer-pkg",
      "title": "Renderer package",
      "description": "Deterministic Markdown generation",
      "status": "completed",
      "phase": 1,
      "area": "renderer",
      "type": "Added"
    },
    {
      "id": "cli-commands",
      "title": "CLI with validate, generate, stats, deps",
      "description": "Core CLI subcommands for task list management",
      "status": "completed",
      "phase": 1,
      "area": "cli",
      "type": "Added"
    },
    {
      "id": "two-dim-categorization",
      "title": "Two-dimensional categorization",
      "description": "Area (project component) + Type (change type)",
      "status": "completed",
      "phase": 1,
      "area": "core",
      "type": "Added"
    },
    {
      "id": "grouping-strategies",
      "title": "Multiple grouping strategies",
      "description": "Group by area, type, phase, status",
      "status": "completed",
      "phase": 1,
      "area": "renderer",
      "type": "Added"
    },
    {
      "id": "phased-tasks",
      "title": "Phased task lists with area sub-sections",
      "description": "Support for large projects with hierarchical structure",
      "status": "completed",
      "phase": 1,
      "area": "renderer",
      "type": "Added"
    },
    {
      "id": "toc-progress",
      "title": "Table of contents with progress counts",
      "description": "TOC showing completion status per section",
      "status": "completed",
      "phase": 1,
      "area": "renderer",
      "type": "Added"
    },
    {
      "id": "overview-table",
      "title": "Overview table",
      "description": "Summary table of all tasks",
      "status": "completed",
      "phase": 1,
      "area": "renderer",
      "type": "Added"
    },
    {
      "id": "deps-graph",
      "title": "Dependency graph generation",
      "description": "Mermaid and DOT format graph output",
      "status": "completed",
      "phase": 1,
      "area": "cli",
      "type": "Added"
    },
    {
      "id": "json-schema",
      "title": "JSON Schema for validation",
      "description": "Schema-based IR validation",
      "status": "completed",
      "phase": 1,
      "area": "core",
      "type": "Added"
    },
    {
      "id": "goreleaser",
      "title": "GoReleaser configuration",
      "description": "Multi-platform binary releases (Linux, macOS, Windows)",
      "status": "completed",
      "phase": 2,
      "area": "distribution",
      "type": "Added"
    },
    {
      "id": "homebrew",
      "title": "Homebrew tap distribution",
      "description": "Install via brew install grokify/tap/stasks",
      "status": "completed",
      "phase": 2,
      "area": "distribution",
      "type": "Added"
    },
    {
      "id": "version-cmd",
      "title": "Version command",
      "description": "Show build info (version, commit, date)",
      "status": "completed",
      "phase": 2,
      "area": "cli",
      "type": "Added"
    },
    {
      "id": "overview-sorting",
      "title": "Overview table sorting",
      "description": "Sort by completion percentage",
      "status": "completed",
      "phase": 2,
      "area": "renderer",
      "type": "Added"
    },
    {
      "id": "embed-mermaid",
      "title": "Embed dependency graph in Markdown",
      "description": "Option to include Mermaid diagram in generated TASKS.md",
      "status": "planned",
      "phase": 3,
      "area": "renderer",
      "type": "Added"
    },
    {
      "id": "html-output",
      "title": "HTML output format",
      "description": "Generate standalone HTML with styling",
      "status": "planned",
      "phase": 3,
      "area": "renderer",
      "type": "Added"
    },
    {
      "id": "progress-viz",
      "title": "Progress visualization",
      "description": "Progress bars or burndown charts in output",
      "status": "planned",
      "phase": 3,
      "area": "renderer",
      "type": "Added"
    },
    {
      "id": "timeline-view",
      "title": "Timeline/Gantt view",
      "description": "Generate Gantt-style timeline from target dates",
      "status": "planned",
      "phase": 3,
      "area": "renderer",
      "type": "Added"
    },
    {
      "id": "init-cmd",
      "title": "stasks init command",
      "description": "Create starter TASKS.json interactively",
      "status": "planned",
      "phase": 4,
      "area": "cli",
      "type": "Added"
    },
    {
      "id": "watch-mode",
      "title": "Watch mode for auto-regeneration",
      "description": "stasks generate --watch to auto-regenerate on changes",
      "status": "planned",
      "phase": 4,
      "area": "cli",
      "type": "Added"
    },
    {
      "id": "diff-cmd",
      "title": "stasks diff command",
      "description": "Compare two task list versions and show changes",
      "status": "planned",
      "phase": 4,
      "area": "cli",
      "type": "Added"
    },
    {
      "id": "migrate-cmd",
      "title": "stasks migrate command",
      "description": "Migrate TASKS.json between schema versions",
      "status": "planned",
      "phase": 4,
      "area": "cli",
      "type": "Added"
    },
    {
      "id": "stakeholder-filter",
      "title": "Stakeholder view filtering",
      "description": "Filter output by audience (dev, product, exec)",
      "status": "planned",
      "phase": 4,
      "area": "renderer",
      "type": "Added"
    },
    {
      "id": "github-sync",
      "title": "GitHub Issues/Projects sync",
      "description": "Import from and export to GitHub Issues or Projects",
      "status": "planned",
      "phase": 5,
      "area": "integrations",
      "type": "Added"
    },
    {
      "id": "claude-plugin",
      "title": "Claude Code plugin",
      "description": "Plugin for AI-assisted task list management",
      "status": "planned",
      "phase": 5,
      "area": "integrations",
      "type": "Added"
    },
    {
      "id": "schangelog-sync",
      "title": "Structured Changelog sync",
      "description": "Auto-move completed tasks to CHANGELOG.json",
      "status": "planned",
      "phase": 5,
      "area": "integrations",
      "type": "Added"
    },
    {
      "id": "jira-import",
      "title": "Jira import",
      "description": "Import tasks from Jira epics/stories",
      "status": "future",
      "area": "integrations",
      "type": "Added"
    },
    {
      "id": "notion-export",
      "title": "Notion export",
      "description": "Export task list to Notion database",
      "status": "future",
      "area": "integrations",
      "type": "Added"
    },
    {
      "id": "linear-sync",
      "title": "Linear sync",
      "description": "Bidirectional sync with Linear projects",
      "status": "future",
      "area": "integrations",
      "type": "Added"
    },
    {
      "id": "velocity-tracking",
      "title": "Velocity tracking",
      "description": "Track completion velocity and predict timelines",
      "status": "future",
      "area": "core",
      "type": "Added"
    },
    {
      "id": "multi-project",
      "title": "Multi-project aggregation",
      "description": "Aggregate task lists from multiple projects into a unified view",
      "status": "future",
      "area": "core",
      "type": "Added",
      "dependsOn": ["cross-project-deps"]
    },
    {
      "id": "cross-project-deps",
      "title": "Cross-project dependency references",
      "description": "Allow tasks to reference dependencies in other project task lists via repository URI",
      "status": "future",
      "area": "core",
      "type": "Added"
    },
    {
      "id": "overdue-alerts",
      "title": "Overdue task alerts",
      "description": "Highlight tasks past their target date",
      "status": "future",
      "area": "cli",
      "type": "Added"
    }
  ]
}
