{
  "irVersion": "1.0",
  "project": "Example Project",

  "legend": {
    "completed": {"emoji": "✅", "description": "Completed"},
    "inProgress": {"emoji": "🚧", "description": "In Progress"},
    "planned": {"emoji": "📋", "description": "Planned"},
    "future": {"emoji": "💡", "description": "Under Consideration"}
  },

  "areas": [
    {"id": "core", "name": "Core"},
    {"id": "api", "name": "API"},
    {"id": "docs", "name": "Documentation"}
  ],

  "tasks": [
    {
      "id": "auth",
      "title": "User authentication",
      "description": "Implement JWT-based authentication",
      "status": "inProgress",
      "phase": 1,
      "area": "core",
      "type": "Added",
      "blocks": ["api-endpoints"],
      "subtasks": [
        {"id": "auth-1", "description": "Design auth flow", "completed": true},
        {"id": "auth-2", "description": "Implement JWT signing", "completed": true},
        {"id": "auth-3", "description": "Add refresh tokens", "completed": false}
      ]
    },
    {
      "id": "database",
      "title": "Database schema",
      "description": "Set up PostgreSQL with migrations",
      "status": "completed",
      "phase": 1,
      "area": "core",
      "type": "Added"
    },
    {
      "id": "api-endpoints",
      "title": "REST API endpoints",
      "description": "Implement CRUD endpoints for all resources",
      "status": "planned",
      "phase": 1,
      "area": "api",
      "type": "Added",
      "dependsOn": ["auth", "database"]
    },
    {
      "id": "caching",
      "title": "Add Redis caching",
      "description": "Cache frequently accessed data",
      "status": "planned",
      "phase": 2,
      "area": "core",
      "type": "Added"
    },
    {
      "id": "api-docs",
      "title": "API documentation",
      "description": "Generate OpenAPI spec and docs site",
      "status": "planned",
      "phase": 2,
      "area": "docs",
      "type": "Added",
      "dependsOn": ["api-endpoints"]
    },
    {
      "id": "graphql",
      "title": "GraphQL API",
      "description": "Add GraphQL alongside REST",
      "status": "future",
      "area": "api",
      "type": "Added"
    },
    {
      "id": "i18n",
      "title": "Internationalization",
      "description": "Support multiple languages",
      "status": "future",
      "area": "core",
      "type": "Added"
    }
  ]
}
