{
  "irVersion": "1.0",
  "project": "My Project",
  "tasks": [
    {
      "id": "task-1",
      "title": "First task",
      "status": "inProgress"
    },
    {
      "id": "task-2",
      "title": "Second task",
      "status": "planned"
    }
  ]
}
